import Myanmar from "../assets/myanmar.svg";

const Timeline = () => {
  return (
    <div className="mt-24 container mx-auto">
      <ul className="timeline timeline-snap-icon max-md:timeline-compact timeline-vertical">
        <li>
          <div className="timeline-middle">
            <img src={Myanmar} alt="" className="w-12" />
            {/* <svg
                xmlns="http://www.w3.org/2000/svg"
                viewBox="0 0 20 20"
                fill="currentColor"
                className="h-5 w-5"
              >
                <path
                  fillRule="evenodd"
                  d="M10 18a8 8 0 100-16 8 8 0 000 16zm3.857-9.809a.75.75 0 00-1.214-.882l-3.483 4.79-1.88-1.88a.75.75 0 10-1.06 1.061l2.5 2.5a.75.75 0 001.137-.089l4-5.5z"
                  clipRule="evenodd"
                />
              </svg> */}
          </div>
          <div className="timeline-start mb-10 md:text-end">
            <time className="font-mono italic">ဘီစီ ၂၀၀၀ - အေဒီ ၇ ရာစု</time>
            <div className="text-lg font-black">ပျူခေတ်</div>
            ပျူခေတ်တွင် ဧရာဝတီမြစ်ဝှမ်းတလျှောက် ပျူခေတ်မြို့ပြ၊
            တိုင်းနိုင်ငံများကို ထူထောင်ခဲ့ကြသည်။
            အင်အားအတောင့်တင်းဆုံးပျူခေတ်နိုင်ငံတော်မှာ သရေခေတ္တရာဖြစ်သည်။
            အိန္ဒိယနှင့် တရုတ်နိုင်ငံအကြား ကုန်သွယ်ရေး လမ်းကြောင်းပေါ်တွင်
            တည်ရှိသည်။ ပျူလူမျိုးများသည် ၆၅၆ ခုနှစ်ခန့်တွင် တစုံတခုသော
            အကြောင်းကြောင့် သရေခေတ္တရာကို စွန့်ခွာပြီး မြောက်ဘက်သို့
            ပြောင်းရွှေ့ခဲ့ကြကာ ပုဂံဒေသတွင် မြို့ပြများ ထူထောင်ခဲ့ကြသည်။
          </div>
          <hr />
        </li>
        <li>
          <hr />
          <div className="timeline-middle">
            <img src={Myanmar} alt="" className="w-12" />
            {/* <svg
                xmlns="http://www.w3.org/2000/svg"
                viewBox="0 0 20 20"
                fill="currentColor"
                className="h-5 w-5"
              >
                <path
                  fillRule="evenodd"
                  d="M10 18a8 8 0 100-16 8 8 0 000 16zm3.857-9.809a.75.75 0 00-1.214-.882l-3.483 4.79-1.88-1.88a.75.75 0 10-1.06 1.061l2.5 2.5a.75.75 0 001.137-.089l4-5.5z"
                  clipRule="evenodd"
                />
              </svg> */}
          </div>
          <div className="timeline-end mb-10">
            <time className="font-mono italic">၁၀၄၄-၁၂၈၇</time>
            <div className="text-lg font-black">ပုဂံခေတ်</div>
            ပျူ မြို့ပြများမှ ရွှေ့ပြောင်းလာသူများ နှင့် မြန်မာလူမျိုးများသည် ၇
            ရာစုနှစ်ခန့်မှစ၍ ပုဂံဒေသ အနီးတဝိုက်တွင် အခြေချခဲ့ကြပြီး အေဒီ ၈၄၉
            ခုနှစ်ခန့်တွင် ပုဂံကို အခြေပြု၍ အင်အားတောင့်တင်းသည့်
            မင်းနေပြည်တော်တစ်ခုကို ထူထောင်ခဲ့ကြသည်။ အနော်ရထာမင်းတရားကြီး (၁၀၄၄ -
            ၁၀၇၇) နန်းတက်ခဲ့သည့်ကာလက ဗမာလူမျိုးများ၏ ဩဇာမှာ
            ယနေ့မြန်မာနိုင်ငံတစ်လွှားသက်ရောက်လွှမ်းမိုးခဲ့သည်။
            ၁⁠၁၀၀-ခုနှစ်တွင်မူ အရှေ့တောင်အာရှတိုက်၏ ဒေသအတော်များ⁠များကို
            ပုဂံမင်းနေပြည်တော်မှ ထိန်းချုပ်နိုင်ခဲ့သည်။ ယင်းကို အများက
            ပထမမြန်မာအင်ပါယာအဖြစ်လက်ခံကြသည်။ ၁၂၀၀ ခုနှစ်အနှောင်းပိုင်းကာလတွင်
            ကူဗလိုင်ခန် ဦးဆောင်သော မွန်ဂိုတို့က ပုဂံနေပြည်တော်အား
            သိမ်းပိုက်ခဲ့ကြသည်။
          </div>
          <hr />
        </li>
        <li>
          <hr />
          <div className="timeline-middle">
            <img src={Myanmar} alt="" className="w-12" />
          </div>
          <div className="timeline-start mb-10 md:text-end">
            <time className="font-mono italic">၁၂၈၇-၁၅၃၁</time>
            <div className="text-lg font-black">ထီးပြိုင်နန်းပြိုင်ခေတ်</div>
            သို့သော် ၁၃၆၄ ခုနှစ်တွင် မြန်မာများသည် အင်းဝဒေသတွင် မိမိတို့၏
            မင်းနေပြည်တော်ကို တည်ထောင်ခဲ့ကြပြီး မြန်မာ့ယဉ်ကျေးမှု၏
            ရွှေရောင်လွှမ်းသော ခေတ်တစ်ခုကို ထူထောင်နိုင်ခဲ့ကြသည်။ သို့သော် ၁၅၂၇
            ခုနှစ်တွင် ရှမ်းများက အင်းဝကို ဖျက်ဆီးပစ်ခဲ့ကြသည်။ တစ်ချိန်တည်းတွင်
            မွန်တို့သည် ပဲခူးကို အခြေပြုပြီးအဓိကကျသော ကူးသန်းရောင်းဝယ်ရေးနှင့်
            ဘာသာရေး ဗဟိုအချက်အချာအဖြစ် ပြန်လည်ရပ်တည်ခဲ့သည်။
          </div>
          <hr />
        </li>
        <li>
          <hr />
          <div className="timeline-middle">
            <img src={Myanmar} alt="" className="w-12" />
          </div>
          <div className="timeline-end mb-10">
            <time className="font-mono italic">၁၅၃၁-၁၇၅၂</time>
            <div className="text-lg font-black">တောင်ငူခေတ်</div>
            အင်းဝမှ ထွက်‌ပြေးခဲ့ကြသော ဗမာများသည် ၁၅၃၁ ခုနှစ်တွင် တောင်ငူ၌
            တောင်ငူမင်းနေပြည်တော်ကို တပင်ရွှေထီးလက်အောက်တွင် ထူထောင်ခဲ့ကြသည်။
            သူသည် မြန်မာနိုင်ငံကို စည်းရုံးပြီး ဒုတိယမြန်မာအင်ပါယာကို
            ထူထောင်ခဲ့သည်။ အရှေ့တောင်အာရှတွင် ဥရောပတိုက်သားများ၏
            လွှမ်းမိုးမှုကြောင့် တောင်ငူမင်းနေပြည်တော်သည်လည်းကူးသန်း
            ရောင်းဝယ်ရေး ဗဟိုချက်အချာဖြစ်လာသည်။ ဘုရင့်နောင် မင်းတရားကြီးသည်
            မဏိပူရ၊ ဇင်းမယ်နှင့် အယုဓျာတို့အား သိမ်းသွင်း၍ နိုင်ငံတော်ကြီးအား
            ချဲ့ထွင်ခဲ့သည်။ သို့သော်လည်း အတွင်းပုန်ကန်မှုများနှင့်
            သိမ်းပိုက်နယ်‌မြေများကို ထိန်းချုပ်နိုင်ရန် လိုအပ်သော ဘုရင်မြစ်များ
            ချို့တဲ့မှုကြောင့်တောင်ငူနေပြည်တော်ကျဆုံးခဲ့ရသည်။ ပေါ်တူဂီများအား
            တိုက်ထုတ်ခဲ့သော အနောက်ဘက်လွန်မင်းတရားကြီးသည် ၁၆၁၃ ခုနှစ်တွင်
            မင်းဆက်သစ်တစ်ခုကို အင်းဝတွင် ထူထောင်ခဲ့သည်။ ၁၇၅၂ ခုနှစ်တွင်
            ပြင်သစ်တို့၏ အကူအညီဖြင့် ထကြွပုန်ကန်သော
            မွန်တို့ကြောင့်နေပြည်တော်ကျဆုံးခဲ့သည်။
          </div>
          <hr />
        </li>
        <li>
          <hr />
          <div className="timeline-middle">
            <img src={Myanmar} alt="" className="w-12" />
          </div>
          <div className="timeline-start mb-10 md:text-end">
            <time className="font-mono italic">၁၇၅၂-၁၈⁠၈၅</time>
            <div className="text-lg font-black">ကုန်းဘောင်ခေတ်</div>
            ၁၇၅၂ ခုနှစ်တွင် အလောင်းဘုရားသည် ကုန်းဘောင်မင်းဆက်ကို ထူထောင်ပြီး
            တတိယမြန်မာအင်ပါယာကြီးကို တည်ဆောက်ခဲ့သည်။ ၁၇၆၇ ခုနှစ်တွင်
            မြေဒူးမင်းတရားကြီးက အယုဓျာနိုင်ငံအား သိမ်းပိုက်အောင်မြင်ခဲ့ပြီး
            မြန်မာ့ယဉ်ကျေးမှုက ထိုင်းယဉ်ကျေးမှုအပေါ်အတော်လွှမ်းမိုးစေခဲ့သည်။
            တရုတ်ပြည် ချင်မင်းဆက်သည် မြန်မာတို့၏ ကြီးထွားလာသော အင်အားကို
            စိုးရိမ်းသဖြင့်မြန်မာကို ၁၇၆၅ ၁၇၆၉ ခုနှစ်ကာလတွင်း တရုတ် - မြန်မာ
            စစ်ပွဲများလေးကြိမ်တိတိသိမ်းပိုက်ရန်ကြိုးစားအားထုတ်ခဲ့သော်လည်း
            မအောင်မြင်ခဲ့ပေ။ နောက်မင်းဆက်များက အယုဓျာအား စွန့်လွှတ်ခဲ့ရသော်လည်း
            ရခိုင်နှင့် တနင်္သာရီတို့ကို ရရှိခဲ့သည်။ ၁၈၂၄
            ခုနှစ်ဘကြီးတော်မင်းတရားလက်ထက်တွင် စစ်သူကြီးမဟာဗန္ဓုလသည်
            အိန္ဒိယနိုင်ငံရှိဗြိတိသျှတို့၏ နယ်‌‌မြေနှင့် ထိစပ်နေသော
            အာသံပြည်နယ်ကို သိမ်းပိုက်ရာမှ စစ်မီးပွားခဲ့သည်။ ပထမ အင်္ဂလိပ် -
            မြန်မာစစ်ပွဲကို ၁၈၂၆ ခုနှစ်တွင် မြန်မာနိုင်ငံအလယ်ပိုင်းမြင်းခြံမြို့
            ရန္တပိုရွာတွင် စာချုပ်ချုပ်၍ ငြိမ်းစေခဲ့ပြီး
            ကမ်းရိုးတန်းဒေသများဖြစ်သည့်ရခိုင်နှင့် တနင်္သာရီဒေသများကို
            စွန့်လွှတ်ခဲ့ရသည်။ ၁၈၅၂ ခုနှစ်တွင် သာယာဝတီမင်းတရားကြီးသည်
            နယ်စပ်ပြဿနာများမှ ပေါ်ပေါက်လာသည့် အခင်းများမှ
            အင်္ဂလိပ်အရာရှိများအားဖမ်းဆီးခဲ့သည်ကို အကြောင်း
            ပြုပြီးဒုတိယအင်္ဂလိပ်မြန်မာစစ်ပွဲဖန်တီးခဲ့ကြသည်။ ဤတစ်ကြိမ်တွင်
            အင်္ဂလိပ်တို့သည် ကျန်ရှိနေသေးသည့် ကမ်းရိုးတန်းဒေသများဖြစ်သည့်
            ဧရာဝတီ၊ ရန်ကုန်နှင့် ပဲခူးတို့အား သိမ်းပိုက်ခဲ့သည်။ ၁၈⁠၈၅ ခုနှစ်တွင်
            မြန်မာကောက်တော်များသည် ဘုရင့်အမိန့်တော်အရ တာဝန်ဝတ္တရားများ
            ဆောင်ရွက်ရာမှ ဘုံဘေ-ဘားမားသစ်ကုမ္ပဏီသည် သစ်များကို
            တရားမဝင်ခုတ်လှဲပြီး အခွန်တိမ်း ရှောင်ရန် ဝှက်ထားသည်ကို
            စစ်ဆေးတွေ့ရှိခဲ့သည်။ သီပေါမင်းသည် ကုမ္ပဏီအားဒဏ်ရိုက်အရေးယူခဲ့သည် ကို
            ဗြိတိသျှတို့ဘက်မှ ကျန်ရှိနေသေးသည့် မြန်မာနိုင်ငံအား သိမ်းပိုက်ရန်
            အခွင့်အရေးအဖြစ် ယူဆခဲ့ပြီး ၁၈⁠၈၅ ခုနှစ်နိုဝင်ဘာတွင် ရက်သတ္တ
            နှစ်ပတ်တည်းနှင့် တတိယ အင်္ဂလိပ် - မြန်မာစစ်ပွဲကို ဆင်နွှဲခဲ့လေသည်။
            သီပေါမင်းတရားကြီးနှင့် တကွ တော်ဝင်မိသားစုဝင်များအား ဖမ်းဆီးခဲ့ပြီး
            မဒြစ်သို့ ပြည်နှင် ဒဏ်ပေးခဲ့၍ နောက်ဆုံးတွင် ရတနာဂီရိသို့
            ပို့ဆောင်ခဲ့ကြသည်။
          </div>
          <hr />
        </li>
        <li>
          <hr />
          <div className="timeline-middle">
            <img src={Myanmar} alt="" className="w-12" />
          </div>
          <div className="timeline-end mb-10">
            <time className="font-mono italic">၁၈⁠၈၆-၁၉၄၈</time>
            <div className="text-lg font-black">ဗြိတိသျှအုပ်ချုပ်ရေး</div>
            မြန်မာနိုင်ငံသည် ၁၈⁠၈၅ ခုနှစ် နိုဝင်ဘာကုန်ပိုင်းတွင်
            ဗြိတိသျှအိန္ဒိယ၏ လက်အောက်ခံဒေသတစ်ခုအဖြစ် ကျရောက်သွားခဲ့ပြီး ၁၈⁠၈၆
            ခုနှစ်၊ ဇန်နဝါရီ ၁ရက်နေ့တွင် ဝိတိုရိယဘုရင်မကြီးအား
            နှစ်သစ်ကူးလက်ဆောင်အဖြစ် ဆက်သခဲ့ကြသည်။ ၁၉၃၇ ခုနှစ် ဧပြီ ၁ ရက်တွင်
            မြန်မာနိုင်ငံသည် သီးခြားအုပ်ချုပ်နယ်မြေဖြစ်လာပြီး အိန္ဒယနိုင်ငံနှင့်
            ခွဲခဲ့သည်။ တိုင်းပြည်အတွင်းခွဲရေးတွဲရေး အရေးအခင်းကြောင့်
            ပေါ်ပေါက်လာသော အက်ကွဲကြောင်းသည် လွတ်လပ်ရေးရပြီး
            နောက်ပိုင်းဆက်ဖြစ်လာသည့် ပြည်တွင်းဆူပူသောင်းကျန်းမှုများ၏
            မြစ်ဖျားခံရာအဖြစ် တွေ့ရှိရမည်ဖြစ်သည်။ ၁၉၄၀ ခုနှစ်တွင်
            ဗိုလ်ချုပ်အောင်ဆန်းဦးဆောင်သည့် ရဲဘော်သုံးကျိပ်အဖွဲ့ဝင်တို့သည်
            ဗမာ့လွတ်မြောက်ရေးတပ်မတော် (ဘီအိုင်အေ) ကို တည်ထောင်ခဲ့ကြသည်။[၂၂][၂၂]
            ရဲဘော်သုံးကျိပ်သည် ဂျပန်နိုင်ငံတွင်
            စစ်သင်တန်းများတက်ရောက်ခဲ့ကြသည်။[၂၂] ဒုတိယကမ္ဘာစစ်ကာလ
            မြန်မာနိုင်ငံသည် အရှေ့တောင်အာရှစစ်မျက်နှာတွင် အရေးပါသည့် အခန်းကမှ
            ပါဝင်ခဲ့သည်။ စစ်ပွဲ၏ ကနဦးပိုင်း မြန်မာပြည်စစ်ဆင်ရေးတွင်
            ဂျပန်ဦးဆောင်မှုသည် အောင်မြင်မှုများ ရရှိခဲ့ပြီး ဗြိတိသျှများအား
            မြန်မာပြည်အနှံ့မှ တိုက်ထုတ်နိုင်ခဲ့သည်။ သို့သော်မဟာမိတ်များက
            ပြန်လည်တုံ့ပြန်ခဲ့သည်။ ၁၉၄၅ ခုနှစ် ဇူလိုင်တွင် မဟာမိတ်များက
            ပြန်လည်သိမ်းပိုက်နိုင်ခဲ့သည်။ မြန်မာတို့သည် နှစ်ဘက်စလုံးမှ
            ပါဝင်ခဲ့ကြသည်။ မြန်မာများသည် အစပိုင်းတွင် ဂျပန်တို့ဘက်မှ
            ပါဝင်ခဲ့ကြသော်လည်း မြန်မာအချို့တို့သည် ၁၉၄၁-၁၉၄၂ ခုနှစ်များတွင်
            အင်္ဂလိပ်တို့ဘက်မှ ပါဝင်တိုက်ခိုက်ခဲ့ကြသည်။ ၁၉၄၃ ခုနှစ်တွင်
            ချင်းတပ်နှင့် ကချင်တပ်များကို ဗြိတိသျှတို့ ထိန်းချုပ်သည့်
            နယ်စပ်ဒေသများတွင် ဖွဲ့စည်းခဲ့ကြသည်။ ဗမာ့သေနတ်ကိုင်တပ်ရင်းများသည်
            ၁၉၄၃-၁၉၄၅ ခုနှစ်တွင် ဗိုလ်ချုပ်အော့်ဝင်းဂိတ်၏ လက်အောက်၌
            ချင်းဒစ်တပ်ဖွဲ့များအဖြစ်ပါဝင်တိုက်ခိုက်ခဲ့ကြသည်။ နောက်ပိုင်းတွင်
            အမေရိကန်များကန်-ကချင်အထူးတပ်များအားဖွဲ့စည်းခဲ့ပြီး
            မဟာမိတ်တို့အောက်တွင် ပါဝင်တိုက်ခိုက်ခဲ့ကြသည်။ အခြားများစွာသော
            တပ်ဖွဲ့များမှာ ဗြိတိသျှအထူးစစ်ဆင်ရေးအဖွဲ့များ အောက်တွင်
            ပါဝင်ခဲ့ကြသည်။ ဗမာ့လွတ်မြောက်ရေး တပ်မတော်သည် ဗိုလ်ချုပ်အောင်ဆန်း၏
            ဦးဆောင်မှုအောက်တွင် ရခိုင်အမျိုးသားတပ်မတော်နှင့် အတူဂျပန်တို့ဘက်မှ
            ပါဝင်၍ ၁၉၄၂-၁၉၄၄ ခုနှစ်များတွင် ပါဝင်တိုက်ပွဲဝင်ခဲ့ကြပြီး ၁၉၄၅
            ခုနှစ်တွင် ဂျပန်တို့အား ပြန်လှန်တွန်းလှန်ခဲ့ကြလေသည်။ ၁၉၄၇ ခုနှစ်တွင်
            ဗိုလ်ချုပ်အောင်ဆန်းသည် ကြားဖြတ်အစိုးရအဖွဲ့၊
            မြန်မာနိုင်ငံအမှုဆောင်ကောင်စီအဖွဲ့၏ ဒုတိယဥက္ကဋ္ဌဖြစ်ခဲ့သည်။
          </div>
          <hr />
        </li>
        <li>
          <hr />
          <div className="timeline-middle">
            <img src={Myanmar} alt="" className="w-12" />
          </div>
          <div className="timeline-start mb-10 md:text-end">
            <time className="font-mono italic">၁၉၄၈-၁၉၆၂</time>
            <div className="text-lg font-black">ဒီမိုကရက်တစ်သမ္မတနိုင်ငံ</div>
            ၁၉၄၈ ခုနှစ် ဇန်နဝါရီ ၄ ရက်တွင် မြန်မာနိုင်ငံသည် ပထမဦးဆုံး သမ္မတ
            အဖြစ် စဝ်ရွှေသိုက် နှင့် ပထမဦးဆုံး ဝန်ကြီးချုပ်ဦးနု တို့
            တာဝန်ယူခဲ့သော လွတ်လပ်သည့် သမ္မတနိုင်ငံဖြစ်သော
            ပြည်ထောင်စုမြန်မာနိုင်ငံအဖြစ် ရပ်တည်ခဲ့လေသည်။
            အခြားဗြိတိသျှကိုလိုနီနိုင်ငံများနှင့်
            မတူညီဘဲဓနသဟာယအဖွဲ့ဝင်အဖြစ်မပါဝင်ခဲ့ချေ။ အထက်လွှတ်တော်နှင့်
            လူမျိုးစုလွှတ်တော်နှစ်ရပ် ပါဝင်သော ပါလီမန်စနစ်ကို
            ကျင့်သုံးခဲ့သည်။[၂၃] ယနေ့မြင်တွေ့ရသော မြန်မာနိုင်ငံသည်
            အောက်မြန်မာနိုင်ငံနှင့် အထက်မြန်မာနိုင်ငံတို့
            ပါဝင်သည့်မြန်မာပြည်မနှင့် ဗြိတိသျှတို့သီးခြားအုပ်ချုပ်ခဲ့သည့်
            နယ်ခြားဒေသတို့ကို ပူးပေါင်း၍ ဖွဲ့စည်းထားပြီး
            ပင်လုံစာချုပ်အရဖြစ်လာသော နယ်မြေအဖြစ်ဇစ်မြစ်လိုက်၍ ရလေသည်။[၂၄] ၁၉၆၁
            ခုနှစ်တွင် ထိုစဉ်က မြန်မာနိုင်ငံ၏ ကုလသမဂ္ဂ
            အမြဲတမ်းကိုယ်စားလှယ်အဖြစ်နှင့် ယခင်ဝန်ကြီးပေး ခဲ့ဘူးသည့် ဦးသန့်သည်
            ကုလသမဂ္ဂ၏ အထွေထွေ အတွင်းရေးမှူးချုပ်အဖြစ် အရွေးချယ်ခံခဲ့ရသည်။[၂၅]
          </div>
        </li>
      </ul>
    </div>
  );
};
export default Timeline;
